Tekla.Structures.Dialog.UIControls.WpfMeshCatalog
The WpfMeshCatalog class represents a group of controls to select meshes
using the mesh catalog.
WpfMeshCatalog

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.button_Loaded(System.Object,System.Windows.RoutedEventArgs)
When the load event is raised, the control begins to enumerate through the shape
catalog.
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.button_Click(System.Object,System.Windows.RoutedEventArgs)
Opens the mesh catalog dialog for selecting a mesh
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.SelectedMeshName
The mesh name in the control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.SelectedMeshGrade
The mesh grade in the control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.WpfMeshCatalog.InitializeComponent
InitializeComponent